[
    {
      "productImage": " https://i.ibb.co/4PLtzKb/i-Phone-16-Mock-Header-1.jpg",
      "productName": "iphone 16",
      "tags": ["Iphone", "Gadgets", "Tech"],
      
      "upvoteButton": 102
     
    },
    {
      "productImage": "https://i.ibb.co/C5vfx31/Apple-Mac-Book-Pro-16-inch.jpg",
      "productName": "Apple-Mac-Book-Pro-16",
      "tags": ["Mac", "Mac Book", "Tech"],
      "upVote": 75
      
    },
    {
      "productImage": "https://i.ibb.co/fq91D4n/Apple-Watch-S9.jpg",
      "productName": "Apple-Watch-S9",
      "tags": ["Apple", "Apple Watch", "Tech"],
      "upvoteButton": 120
     
    },
    {
      
      "productImage": "https://i.ibb.co/9VhQwWN/i-Pad-Air-6.jpg",
      "productName": "iPad 10th generation",
      "tags": ["Ipad", "Apple", "Tech"],
      "description": "",
      "upvoteButton": 90
      
    }
  ]
  

 
  
  
 //desc: 1no sl
 Apple just launched the 2023 iPhone 15 and iPhone 15 Pro models, but as is typical with rumors, analysts, leakers, and others with insider information are already looking to the 2024 iPhone 16 lineup. The iPhone 16 lineup will bring major changes, with Apple expected to increase the size of the iPhone 16 Pro to 6.3 inches and the size of the iPhone 16 Pro to 6.9 inches, marking the first major size upgrade in several years. The size changes will be limited to the iPhone 16 Pro models, with the iPhone 16 models to stay the same size as the iPhone 15 models.
link: https://www.macrumors.com/roundup/iphone-16/

2:https://www.apple.com/macbook-pro/specs/
des: Simultaneously supports full native resolution on the built-in display at 1 billion colors and:
Up to four external displays: Up to three external displays with 6K resolution at 60Hz over Thunderbolt and one external display with up to 4K resolution at 144Hz over HDMI
Up to three external displays: Up to two external displays with 6K resolution at 60Hz over Thunderbolt and one external display with up to 8K resolution at 60Hz or one external display with 4K resolution at 240Hz over HDMI

3: https://www.apple.com/apple-watch-series-9/
des: Our most powerful chip in Apple Watch ever. A magical new way to use your Apple Watch without touching the screen. A display that’s twice as bright. And now you can choose a watch case and band combination that’s carbon neutral.

4: https://www.apple.com/apple-watch-series-9/
des: With Apple Trade In, you can get a great value for your current device and apply it toward a new one. And you can do it all online or at an Apple Store. If your device isn’t eligible for credit, we’ll recycle it for free. It’s good for you and the planet.